461911662/nuttx/arch/xtensa/src/boss1-esp32/esp32_bt_adapter.c
/****************************************************************************
 * arch/xtensa/src/boss1-esp32/esp32_bt_adapter.c
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>
#include <stddef.h>
#include <stdlib.h>
#include <stdio.h>
#include <string.h>
#include <assert.h>
#include <debug.h>
#include <pthread.h>
#include <fcntl.h>
#include <unistd.h>
#include <clock/clock.h>
#include <sys/time.h>
#include <sys/types.h>
#include <sys/stat.h>

#include <nuttx/kmalloc.h>
#include <nuttx/mqueue.h>
#include <nuttx/spinlock.h>
#include <nuttx/irq.h>
#include <nuttx/semaphore.h>
#include <nuttx/kthread.h>
#include <nuttx/wdog.h>
#include <nuttx/wqueue.h>
#include <nuttx/sched.h>
#include <nuttx/signal.h>
#include <irq/irq.h>

#include "hardware/esp32_dport.h"
#include "hardware/wdev_reg.h"
#include "xtensa.h"
#include "xtensa_attr.h"
#include "utils/memory_reserve.h"
#include "esp32_rt_timer.h"
#include "esp32_wireless.h"
#include "esp32_irq.h"
#include "esp32_spicache.h"

#include "esp_bt.h"
#include "esp_log.h"
#include "esp_mac.h"
#include "esp_private/phy.h"
#include "esp_private/wifi.h"
#include "esp_random.h"
#include "esp_timer.h"
#include "periph_ctrl.h"
#include "rom/ets_sys.h"
#include "soc/soc_caps.h"
#include "xtensa/core-macros.h"
#include "xtensa/xtensa_api.h"
#include "private/esp_coexist_internal.h"
#include "private/esp_coexist_adapter.h"

#include "esp32_bt_adapter.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Bluetooth system and controller config */

#define BTDM_CFG_BT_DATA_RELEASE            (1<<0)
#define BTDM_CFG_HCI_UART                   (1<<1)
#define BTDM_CFG_CONTROLLER_RUN_APP_CPU     (1<<2)
#define BTDM_CFG_SCAN_DUPLICATE_OPTIONS     (1<<3)
#define BTDM_CFG_SEND_ADV_RESERVED_SIZE     (1<<4)
#define BTDM_CFG_BLE_FULL_SCAN_SUPPORTED    (1<<5)

/* Sleep mode */

#define BTDM_MODEM_SLEEP_MODE_NONE          (0)
#define BTDM_MODEM_SLEEP_MODE_ORIG          (1)
#define BTDM_MODEM_SLEEP_MODE_EVED          (2)  /* sleep mode for BLE controller, used only for internal test. */

/* Low Power Clock Selection */

#define BTDM_LPCLK_SEL_XTAL                 (0)
#define BTDM_LPCLK_SEL_XTAL32K              (1)
#define BTDM_LPCLK_SEL_RTC_SLOW             (2)
#define BTDM_LPCLK_SEL_8M                   (3)

/* Sleep and wakeup interval control */

#define BTDM_MIN_SLEEP_DURATION             (12) /* threshold of interval in slots to allow to fall into modem sleep */
#define BTDM_MODEM_WAKE_UP_DELAY            (4)  /* delay in slots of modem wake up procedure, including re-enable PHY/RF */

#define OSI_FUNCS_TIME_BLOCKING             0xffffffff
#define OSI_VERSION                         0x00010005
#define OSI_MAGIC_VALUE                     0xfadebead

#ifdef CONFIG_PM
#  define BTDM_MIN_TIMER_UNCERTAINTY_US     (500)
#endif

#define BTDM_ASYNC_WAKEUP_REQ_HCI           0
#define BTDM_ASYNC_WAKEUP_REQ_COEX          1
#define BTDM_ASYNC_WAKEUP_REQ_CTRL_DISA     2
#define BTDM_ASYNC_WAKEUP_REQMAX            3

#define MSG_QUEUE_NAME_SIZE                 16

#ifdef CONFIG_ESP32_SPIFLASH
#  define BLE_TASK_EVENT_QUEUE_ITEM_SIZE    8
#  define BLE_TASK_EVENT_QUEUE_LEN          8
#endif

#ifdef CONFIG_ESP32_BT_INTERRUPT_SAVE_STATUS
#  define NR_IRQSTATE_FLAGS   CONFIG_ESP32_BT_INTERRUPT_SAVE_STATUS
#else
#  define NR_IRQSTATE_FLAGS   3
#endif

#define RTC_CLK_CAL_FRACT  19  /* Number of fractional bits in values returned by rtc_clk_cal */

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* VHCI function interface */

typedef struct vhci_host_callback_s
{
  void (*notify_host_send_available)(void);               /* callback used to notify that the host can send packet to controller */
  int (*notify_host_recv)(uint8_t *data, uint16_t len);   /* callback used to notify that the controller has a packet to send to the host */
} vhci_host_callback_t;

/* Dram region */

typedef struct
{
  esp_bt_mode_t mode;
  intptr_t start;
  intptr_t end;
} btdm_dram_available_region_t;

struct osi_funcs_s
{
  uint32_t _version;
  xt_handler (*_set_isr)(int n, xt_handler f, void *arg);
  void (*_ints_on)(unsigned int mask);
  void (*_interrupt_disable)(void);
  void (*_interrupt_restore)(void);
  void (*_task_yield)(void);
  void (*_task_yield_from_isr)(void);
  void *(*_semphr_create)(uint32_t max, uint32_t init);
  void (*_semphr_delete)(void *semphr);
  int32_t (*_semphr_take_from_isr)(void *semphr, void *hptw);
  int32_t (*_semphr_give_from_isr)(void *semphr, void *hptw);
  int32_t (*_semphr_take)(void *semphr, uint32_t block_time_ms);
  int32_t (*_semphr_give)(void *semphr);
  void *(*_mutex_create)(void);
  void (*_mutex_delete)(void *mutex);
  int32_t (*_mutex_lock)(void *mutex);
  int32_t (*_mutex_unlock)(void *mutex);
  void *(* _queue_create)(uint32_t queue_len, uint32_t item_size);
  void (* _queue_delete)(void *queue);
  int32_t (* _queue_send)(void *queue, void *item, uint32_t block_time_ms);
  int32_t (* _queue_send_from_isr)(void *queue, void *item, void *hptw);
  int32_t (* _queue_recv)(void *queue, void *item, uint32_t block_time_ms);
  int32_t (* _queue_recv_from_isr)(void *queue, void *item, void *hptw);
  int32_t (* _task_create)(void *task_func,
                           const char *name,
                           uint32_t stack_depth,
                           void *param,
                           uint32_t prio,
                           void *task_handle,
                           uint32_t core_id);
  void (* _task_delete)(void *task_handle);
  bool (* _is_in_isr)(void);
  int (* _cause_sw_intr_to_core)(int core_id, int intr_no);
  void *(* _malloc)(size_t size);
  void *(* _malloc_internal)(size_t size);
  void (* _free)(void *p);
  int32_t (* _read_efuse_mac)(uint8_t mac[6]);
  void (* _srand)(unsigned int seed);
  int (* _rand)(void);
  uint32_t (* _btdm_lpcycles_2_us)(uint32_t cycles);
  uint32_t (* _btdm_us_2_lpcycles)(uint32_t us);
  bool (* _btdm_sleep_check_duration)(uint32_t *slot_cnt);
  void (* _btdm_sleep_enter_phase1)(uint32_t lpcycles);  /* called when interrupt is disabled */
  void (* _btdm_sleep_enter_phase2)(void);
  void (* _btdm_sleep_exit_phase1)(void);  /* called from ISR */
  void (* _btdm_sleep_exit_phase2)(void);  /* called from ISR */
  void (* _btdm_sleep_exit_phase3)(void);  /* called from task */
  bool (* _coex_bt_wakeup_request)(void);
  void (* _coex_bt_wakeup_request_end)(void);
  int (* _coex_bt_request)(uint32_t event,
                           uint32_t latency,
                           uint32_t duration);
  int (* _coex_bt_release)(uint32_t event);
  int (* _coex_register_bt_cb)(coex_func_cb_t cb);
  uint32_t (* _coex_bb_reset_lock)(void);
  void (* _coex_bb_reset_unlock)(uint32_t restore);
  int (* _coex_schm_register_btdm_callback)(void *callback);
  void (* _coex_schm_status_bit_clear)(uint32_t type, uint32_t status);
  void (* _coex_schm_status_bit_set)(uint32_t type, uint32_t status);
  uint32_t (* _coex_schm_interval_get)(void);
  uint8_t (* _coex_schm_curr_period_get)(void);
  void *(* _coex_schm_curr_phase_get)(void);
  int (* _coex_wifi_channel_get)(uint8_t *primary, uint8_t *secondary);
  int (* _coex_register_wifi_channel_change_callback)(void *cb);
  xt_handler (*_set_isr_l3)(int n, xt_handler f, void *arg);
  void (*_interrupt_l3_disable)(void);
  void (*_interrupt_l3_restore)(void);
  void *(* _customer_queue_create)(uint32_t queue_len, uint32_t item_size);
  int (* _coex_version_get)(unsigned int *major,
                            unsigned int *minor,
                            unsigned int *patch);
  void (* _patch_apply)(void);
  uint32_t _magic;
};

typedef void (*workitem_handler_t)(void *arg);

/* BLE message queue private data */

struct mq_adpt_s
{
  struct file mq;                        /* Message queue handle */
  uint32_t    msgsize;                   /* Message size */
  char        name[MSG_QUEUE_NAME_SIZE]; /* Message queue name */
};

