461911662/nuttx/arch/xtensa/src/boss1-esp32/esp32_bt_adapter.c
static void coex_bt_wakeup_request_end(void)
{
  async_wakeup_request_end(BTDM_ASYNC_WAKEUP_REQ_COEX);
}

/****************************************************************************
 * Name: coex_bt_request_wrapper
 *
 * Description:
 *   Bluetooth requests coexistence.
 *
 * Input Parameters:
 *   event    - Bluetooth event
 *   latency  - Bluetooth will request coexistence after latency
 *   duration - duration for Bluetooth to request coexistence
 *
 * Returned Value:
 *   0 on success, other values indicate failure
 *
 ****************************************************************************/

static int IRAM_ATTR coex_bt_request_wrapper(uint32_t event,
                                             uint32_t latency,
                                             uint32_t duration)
{
#ifdef CONFIG_ESP32_WIFI_BT_COEXIST
  return coex_bt_request(event, latency, duration);
#else
  return 0;
#endif
}

/****************************************************************************
 * Name: coex_bt_release_wrapper
 *
 * Description:
 *   Bluetooth releases coexistence.
 *
 * Input Parameters:
 *   event - Bluetooth event
 *
 * Returned Value:
 *   0 on success, other values indicate failure
 *
 ****************************************************************************/

static int IRAM_ATTR coex_bt_release_wrapper(uint32_t event)
{
#ifdef CONFIG_ESP32_WIFI_BT_COEXIST
  return coex_bt_release(event);
#else
  return 0;
#endif
}

/****************************************************************************
 * Name: adapter_coex_register_bt_cb_wrapper
 *
 * Description:
 *   Bluetooth registers callback function to coexistence module.
 *   This function is only used on ESP32.
 *
 * Input Parameters:
 *   cb - callback function registered to coexistence module
 *
 * Returned Value:
 *   0 on success, other values indicate failure
 *
 ****************************************************************************/

static int adapter_coex_register_bt_cb_wrapper(coex_func_cb_t cb)
{
#ifdef CONFIG_ESP32_WIFI_BT_COEXIST
  return coex_register_bt_cb(cb);
#else
  return 0;
#endif
}

/****************************************************************************
 * Name: coex_bb_reset_lock_wrapper
 *
 * Description:
 *   To acquire the spin-lock used in resetting Bluetooth baseband.
 *   This function is only used to workaround ESP32 hardware issue.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   Value of the spinlock to be restored
 *
 ****************************************************************************/

static uint32_t IRAM_ATTR coex_bb_reset_lock_wrapper(void)
{
#ifdef CONFIG_ESP32_WIFI_BT_COEXIST
  return coex_bb_reset_lock();
#else
  return 0;
#endif
}

/****************************************************************************
 * Name: coex_bb_reset_unlock_wrapper
 *
 * Description:
 *   To release the spin-lock used in resetting Bluetooth baseband.
 *   This function is only used to workaround ESP32 hardware issue.
 *
 * Input Parameters:
 *   restore - value of the spinlock returned from previous call of
 *             coex_bb_rest_lock
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void IRAM_ATTR coex_bb_reset_unlock_wrapper(uint32_t restore)
{
#ifdef CONFIG_ESP32_WIFI_BT_COEXIST
  coex_bb_reset_unlock(restore);
#endif
}

/****************************************************************************
 * Name: coex_schm_register_btdm_callback_wrapper
 *
 * Description:
 *   Register callback for coexistence scheme.
 *
 * Input Parameters:
 *   callback - callback function to be registered
 *
 * Returned Value:
 *   0 on success, other values indicate failure
 *
 ****************************************************************************/

static int coex_schm_register_btdm_callback_wrapper(void *callback)
{
#ifdef CONFIG_ESP32_WIFI_BT_COEXIST
  return coex_schm_register_callback(COEX_SCHM_CALLBACK_TYPE_BT, callback);
#else
  return 0;
#endif
}

/****************************************************************************
 * Name: coex_schm_status_bit_clear_wrapper
 *
 * Description:
 *   Clear coexistence status.
 *
 * Input Parameters:
 *   type - Coexistence status type
 *   status - Coexistence status
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void coex_schm_status_bit_clear_wrapper(uint32_t type,
                                               uint32_t status)
{
#ifdef CONFIG_ESP32_WIFI_BT_COEXIST
  coex_schm_status_bit_clear(type, status);
#endif
}

/****************************************************************************
 * Name: coex_schm_status_bit_set_wrapper
 *
 * Description:
 *   Set coexistence status.
 *
 * Input Parameters:
 *   type - Coexistence status type
 *   status - Coexistence status
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void coex_schm_status_bit_set_wrapper(uint32_t type, uint32_t status)
{
#ifdef CONFIG_ESP32_WIFI_BT_COEXIST
  coex_schm_status_bit_set(type, status);
#endif
}

/****************************************************************************
 * Name: coex_schm_interval_get_wrapper
 *
 * Description:
 *   Get coexistence scheme interval.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   Coexistence scheme interval
 *
 ****************************************************************************/

static uint32_t coex_schm_interval_get_wrapper(void)
{
#ifdef CONFIG_ESP32_WIFI_BT_COEXIST
  return coex_schm_interval_get();
#else
  return 0;
#endif
}

/****************************************************************************
 * Name: coex_schm_curr_period_get_wrapper
 *
 * Description:
 *   Get current coexistence scheme period.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   Coexistence scheme period
 *
 ****************************************************************************/

