461911662/nuttx/arch/xtensa/src/boss1-esp32/esp32_bt_adapter.c
static uint8_t coex_schm_curr_period_get_wrapper(void)
{
#ifdef CONFIG_ESP32_WIFI_BT_COEXIST
  return coex_schm_interval_get();
#else
  return 0;
#endif
}

/****************************************************************************
 * Name: coex_schm_curr_phase_get_wrapper
 *
 * Description:
 *   Get current coexistence scheme phase.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   Coexistence scheme phase
 *
 ****************************************************************************/

static void *coex_schm_curr_phase_get_wrapper(void)
{
#ifdef CONFIG_ESP32_WIFI_BT_COEXIST
  return coex_schm_curr_phase_get();
#else
  return NULL;
#endif
}

/****************************************************************************
 * Name: coex_wifi_channel_get_wrapper
 *
 * Description:
 *   Get WiFi channel from coexistence module.
 *
 * Input Parameters:
 *   primary - pointer to value of WiFi primary channel
 *   secondary - pointer to value of WiFi secondary channel
 *
 * Returned Value:
 *   0 on success, other values indicate failure
 *
 ****************************************************************************/

static int coex_wifi_channel_get_wrapper(uint8_t *primary,
                                         uint8_t *secondary)
{
#ifdef CONFIG_ESP32_WIFI_BT_COEXIST
  return coex_wifi_channel_get(primary, secondary);
#else
  return -1;
#endif
}

/****************************************************************************
 * Name: coex_register_wifi_channel_change_callback_wrapper
 *
 * Description:
 *   Bluetooth registers callback function to receive notification when Wi-Fi
 *   channel changes.
 *
 * Input Parameters:
 *   cb - callback function registered to coexistence module
 *
 * Returned Value:
 *   0 on success, other values indicate failure
 *
 ****************************************************************************/

static int coex_register_wifi_channel_change_callback_wrapper(void *cb)
{
#ifdef CONFIG_ESP32_WIFI_BT_COEXIST
  return coex_register_wifi_channel_change_callback(cb);
#else
  return -1;
#endif
}

/****************************************************************************
 * Name: coex_version_get_wrapper
 *
 * Description:
 *   Get the version of the coexistence module.
 *
 * Input Parameters:
 *   major - pointer to store the major version number
 *   minor - pointer to store the minor version number
 *   patch - pointer to store the patch version number
 *
 * Returned Value:
 *   0 on success, -1 on failure
 *
 ****************************************************************************/

static int coex_version_get_wrapper(unsigned int *major,
                                    unsigned int *minor,
                                    unsigned int *patch)
{
#ifdef CONFIG_ESP32_WIFI_BT_COEXIST
  coex_version_t version;

  ASSERT(coex_version_get_value(&version) == ESP_OK);

  *major = (unsigned int)version.major;
  *minor = (unsigned int)version.minor;
  *patch = (unsigned int)version.patch;

  return 0;
#endif

  return -1;
}

/****************************************************************************
 * Name: patch_apply
 *
 * Description:
 *   This function resets the BTDM and BT functions based on the current
 *   configuration. If the configuration is not set to BLE only, it resets
 *   the BT functions. If the configuration is not set to BR/EDR only, it
 *   resets the BLE functions.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void patch_apply(void)
{
  config_btdm_funcs_reset();

#ifndef CONFIG_BTDM_CTRL_MODE_BLE_ONLY
  config_bt_funcs_reset();
#endif

#ifndef CONFIG_BTDM_CTRL_MODE_BR_EDR_ONLY
  config_ble_funcs_reset();
#endif
}

/****************************************************************************
 * Other functions
 ****************************************************************************/

/****************************************************************************
 * Name: esp_task_create_pinned_to_core
 *
 * Description:
 *   Create task and bind it to target CPU, the task will run when it
 *   is created
 *
 * Input Parameters:
 *   entry       - Task entry
 *   name        - Task name
 *   stack_depth - Task stack size
 *   param       - Task private data
 *   prio        - Task priority
 *   task_handle - Task handle pointer which is used to pause, resume
 *                 and delete the task
 *   core_id     - CPU which the task runs in
 *
 * Returned Value:
 *   True if success or false if fail
 *
 ****************************************************************************/

static int32_t esp_task_create_pinned_to_core(void *entry,
                                              const char *name,
                                              uint32_t stack_depth,
                                              void *param,
                                              uint32_t prio,
                                              void *task_handle,
                                              uint32_t core_id)
{
  int pid;
#ifdef CONFIG_SMP
  int ret;
  cpu_set_t cpuset;
#endif

  DEBUGASSERT(task_handle != NULL);

#ifdef CONFIG_SMP
  ret = sched_lock();
  if (ret)
    {
      wlerr("Failed to lock scheduler before creating pinned thread\n");
      return false;
    }
#endif

  pid = kthread_create(name, prio, stack_depth, entry,
                       (char * const *)param);
  if (pid > 0)
    {
      if (task_handle)
        {
          *((int *)task_handle) = pid;
        }

#ifdef CONFIG_SMP
      if (core_id < CONFIG_SMP_NCPUS)
        {
          CPU_ZERO(&cpuset);
          CPU_SET(core_id, &cpuset);
          ret = nxsched_set_affinity(pid, sizeof(cpuset), &cpuset);
          if (ret)
            {
              wlerr("Failed to set affinity error=%d\n", ret);
              return false;
            }
        }
#endif
    }
  else
    {
      wlerr("Failed to create task, error %d\n", pid);
    }

#ifdef CONFIG_SMP
  ret = sched_unlock();
  if (ret)
    {
      wlerr("Failed to unlock scheduler after creating pinned thread\n");
      return false;
    }
#endif

  return pid > 0;
}

/****************************************************************************
 * Name: esp_queue_send_generic
 *
 * Description:
 *   Generic send message to queue within a certain period of time
 *
 * Input Parameters:
 *   queue - Message queue data pointer
 *   item  - Message data pointer
 *   ticks - Wait ticks
 *   prio  - Message priority
 *
 * Returned Value:
 *   True if success or false if fail
 *
 ****************************************************************************/

static IRAM_ATTR int32_t esp_queue_send_generic(void *queue, void *item,
                                                uint32_t ticks, int prio)
{
  int ret;
  struct timespec timeout;
  struct mq_adpt_s *mq_adpt = (struct mq_adpt_s *)queue;

#ifdef CONFIG_ESP32_SPIFLASH
  if (!spi_flash_cache_enabled())
    {
      esp_send_queuecache(queue, item, mq_adpt->msgsize);
      return esp_errno_trans(OK);
    }
#endif

  if (ticks == OSI_FUNCS_TIME_BLOCKING || ticks == 0)
    {
      /* BLE interrupt function will call this adapter function to send
       * message to message queue, so here we should call kernel API
       * instead of application API
       */

      ret = file_mq_send(&mq_adpt->mq, (const char *)item,
                         mq_adpt->msgsize, prio);
      if (ret < 0)
        {
          wlerr("Failed to send message to mqueue error=%d\n", ret);
        }
    }
  else
    {
      ret = clock_gettime(CLOCK_REALTIME, &timeout);
      if (ret < 0)
        {
          wlerr("Failed to get time %d\n", ret);
          return esp_errno_trans(ret);
        }

      if (ticks)
        {
          esp_update_time(&timeout, ticks);
        }

      ret = file_mq_timedsend(&mq_adpt->mq, (const char *)item,
                              mq_adpt->msgsize, prio, &timeout);
      if (ret < 0)
        {
          wlerr("Failed to timedsend message to mqueue error=%d\n", ret);
        }
    }

