461911662/nuttx/arch/xtensa/src/boss1-esp32/esp32_bt_adapter.c
  return esp_errno_trans(ret);
}

/****************************************************************************
 * Name: esp_update_time
 *
 * Description:
 *   Transform ticks to time and add this time to timespec value
 *
 * Input Parameters:
 *   ticks    - System ticks
 *
 * Output Parameters:
 *   timespec - Input timespec data pointer
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void esp_update_time(struct timespec *timespec, uint32_t ticks)
{
  struct timespec ts;

  clock_ticks2time(&ts, ticks);
  clock_timespec_add(timespec, &ts, timespec);
}

/****************************************************************************
 * Name: cause_sw_intr
 *
 * Description:
 *   Set a software interrupt bit
 *
 * Input Parameters:
 *  arg - number of the bit as void pointer
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void IRAM_ATTR cause_sw_intr(void *arg)
{
  /* just convert void * to int, because the width is the same */

  uint32_t intr_no = (uint32_t)arg;
  XTHAL_SET_INTSET((1 << intr_no));
}

#ifdef CONFIG_PM

/****************************************************************************
 * Name: btdm_slp_tmr_customer_callback
 *
 * Description:
 *   Callback function for ESP BLE sleep timer. This function is dispatched
 *   to the controller from `btdm_slp_tmr_callback`. If the power management
 *   lock has been released, it acquires the lock again.
 *
 * Input Parameters:
 *   arg - Unused
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void btdm_slp_tmr_customer_callback(void * arg)
{
  (void)(arg);

  if (g_pm_lock_acquired == false)
    {
      g_pm_lock_acquired = true;
      esp32_pm_lockacquire();
    }
}

/****************************************************************************
 * Name: btdm_slp_tmr_callback
 *
 * Description:
 *   ESP BLE sleep callback function.
 *
 * Input Parameters:
 *   arg - Unused
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void IRAM_ATTR btdm_slp_tmr_callback(void *arg)
{
  (void)(arg);
  btdm_dispatch_work_to_controller(btdm_slp_tmr_customer_callback,
                                   NULL,
                                   true);
}
#endif

/****************************************************************************
 * Name: esp_int_adpt_cb
 *
 * Description:
 *   BT interrupt adapter callback function
 *
 * Input Parameters:
 *   irq     - Number of the IRQ that generated the interrupt
 *   context - Interrupt register state save info (not used)
 *   arg     - Argument passed to the interrupt callback
 *
 * Returned Value:
 *   OK
 *
 ****************************************************************************/

static int IRAM_ATTR esp_int_adpt_cb(int irq, void *context, void *arg)
{
  struct irq_adpt_s *adapter = (struct irq_adpt_s *)arg;

  adapter->func(adapter->arg);

  return OK;
}

/****************************************************************************
 * Name: btdm_wakeup_request_callback
 *
 * Description:
 *   Callback function for ESP BLE wakeup request. This function is
 *   dispatched when a wakeup request is received. If the power management
 *   lock has not been acquired, it acquires the lock. It also stops the
 *   sleep timer and gives the wakeup request semaphore.
 *
 * Input Parameters:
 *   arg - Unused
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void btdm_wakeup_request_callback(void * arg)
{
  (void)(arg);

#if CONFIG_PM
  if (g_pm_lock_acquired == false)
    {
      g_pm_lock_acquired = true;
      esp32_pm_lockacquire();
    }

  esp_timer_stop(g_btdm_slp_tmr);
#endif
  btdm_wakeup_request();

  semphr_give_wrapper(g_wakeup_req_sem);
}

/****************************************************************************
 * Name: btdm_controller_mem_init
 *
 * Description:
 *    Initialize BT controller to allocate task and other resource.
 *
 * Input Parameters:
 *    None
 *
 * Returned Value:
 *    None
 *
 ****************************************************************************/

static void btdm_controller_mem_init(void)
{
  int btdm_dram_regions;

  /* initialise .data section */

  memcpy(_data_start_btdm, (void *)_data_start_btdm_rom,
         _data_end_btdm - _data_start_btdm);

  wlinfo(".data initialise [0x%08x] <== [0x%08x]\n",
         (uint32_t)_data_start_btdm, _data_start_btdm_rom);

  /* initial em, .bss section */

  btdm_dram_regions = sizeof(g_btdm_dram_available_region)
                      / sizeof(btdm_dram_available_region_t);

  for (int i = 1; i < btdm_dram_regions; i++)
    {
      if (g_btdm_dram_available_region[i].mode != ESP_BT_MODE_IDLE)
        {
          memset((void *)g_btdm_dram_available_region[i].start, 0x0,
                 g_btdm_dram_available_region[i].end - \
                 g_btdm_dram_available_region[i].start);
          wlinfo(".bss initialise [0x%08x] - [0x%08x]\n",
                 g_btdm_dram_available_region[i].start,
                 g_btdm_dram_available_region[i].end);
        }
    }
}

/****************************************************************************
 * Name: btdm_config_mask_load
 *
 * Description:
 *   Create a mask with all ESP32 BLE supported features
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   The uint32_t mask
 *
 ****************************************************************************/

static uint32_t btdm_config_mask_load(void)
{
  uint32_t mask = 0x0;

#ifdef CONFIG_BTDM_CTRL_HCI_MODE_UART_H4
  mask |= BTDM_CFG_HCI_UART;
#endif

#ifdef CONFIG_BTDM_CTRL_PINNED_TO_CORE_1
  mask |= BTDM_CFG_CONTROLLER_RUN_APP_CPU;
#endif

#ifdef CONFIG_BTDM_CTRL_FULL_SCAN_SUPPORTED
  mask |= BTDM_CFG_BLE_FULL_SCAN_SUPPORTED;
#endif

  mask |= BTDM_CFG_SCAN_DUPLICATE_OPTIONS;

  mask |= BTDM_CFG_SEND_ADV_RESERVED_SIZE;

  return mask;
}

/****************************************************************************
 * Name: bt_controller_deinit_internal
 *
 * Description:
 *   Deinitialize the internal structures of the Bluetooth controller.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

