461911662/nuttx/arch/xtensa/src/boss1-esp32/esp32_bt_adapter.c
static void bt_controller_deinit_internal(void)
{
  periph_module_disable(PERIPH_BT_MODULE);

#ifdef CONFIG_PM

  if (g_btdm_slp_tmr != NULL)
    {
      esp_timer_stop(g_btdm_slp_tmr);
      esp_timer_delete(g_btdm_slp_tmr);
      g_btdm_slp_tmr = NULL;
    }

  g_pm_lock_acquired = false;
#endif

  if (g_wakeup_req_sem)
    {
      semphr_delete_wrapper(g_wakeup_req_sem);
      g_wakeup_req_sem = NULL;
    }

  if (g_osi_funcs_p)
    {
      free(g_osi_funcs_p);
      g_osi_funcs_p = NULL;
    }

  g_btdm_controller_status = ESP_BT_CONTROLLER_STATUS_IDLE;

  g_btdm_lpcycle_us = 0;
  btdm_controller_set_sleep_mode(BTDM_MODEM_SLEEP_MODE_NONE);

  esp_bt_power_domain_off();

  esp_phy_modem_deinit();
}

/****************************************************************************
 * Name: async_wakeup_request
 *
 * Description:
 *   Request the BLE Controller to wakeup
 *
 * Input Parameters:
 *   event - the event that triggered the wakeup
 *
 * Returned Value:
 *   true if request lock is needed, false otherwise
 *
 ****************************************************************************/

static bool async_wakeup_request(int event)
{
  bool request_lock = false;
  bool do_wakeup_request = false;

  switch (event)
    {
      case BTDM_ASYNC_WAKEUP_REQ_HCI:
        btdm_in_wakeup_requesting_set(true);

        /* No break */

      case BTDM_ASYNC_WAKEUP_REQ_CTRL_DISA:
        if (!btdm_power_state_active())
          {
            do_wakeup_request = true;

            btdm_dispatch_work_to_controller(btdm_wakeup_request_callback,
                                             NULL,
                                             true);
            semphr_take_wrapper(g_wakeup_req_sem, OSI_FUNCS_TIME_BLOCKING);
          }
        break;
      case BTDM_ASYNC_WAKEUP_REQ_COEX:
        if (!btdm_power_state_active())
          {
            do_wakeup_request = true;
#if CONFIG_PM
            if (g_pm_lock_acquired == false)
              {
                g_pm_lock_acquired = true;
                esp32_pm_lockacquire();
              }

            esp_timer_stop(g_btdm_slp_tmr);
#endif
            btdm_wakeup_request();
          }
        break;
      default:
        return false;
    }

  return do_wakeup_request;
}

/****************************************************************************
 * Name: async_wakeup_request_end
 *
 * Description:
 *   Finish a wakeup request
 *
 * Input Parameters:
 *   event - the event that triggered the wakeup
 *
 * Returned Value:
 *   true if request lock is needed, false otherwise
 *
 ****************************************************************************/

static void async_wakeup_request_end(int event)
{
  bool request_lock = false;

  switch (event)
    {
      case BTDM_ASYNC_WAKEUP_REQ_HCI:
        request_lock = true;
        break;
      case BTDM_ASYNC_WAKEUP_REQ_COEX:
      case BTDM_ASYNC_WAKEUP_REQ_CTRL_DISA:
        request_lock = false;
        break;
      default:
        return;
    }

  if (request_lock)
    {
      btdm_in_wakeup_requesting_set(false);
    }
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: esp32_bt_controller_init
 *
 * Description:
 *    Init  BT controller.
 *
 * Input Parameters:
 *    None
 *
 * Returned Value:
 *   Zero (OK) is returned on success. A negated errno value is returned
 *   on failure.
 *
 ****************************************************************************/

int esp32_bt_controller_init(void)
{
  esp_bt_controller_config_t cfg = BT_CONTROLLER_INIT_CONFIG_DEFAULT();
  uint32_t btdm_cfg_mask = 0;
  int err;
  int i;
  bool select_src_ret;
  bool set_div_ret;
#ifdef CONFIG_PM
  esp_timer_create_args_t create_args =
    {
      .callback = btdm_slp_tmr_callback,
      .arg = NULL,
      .name = "btSlp"
    };
#endif

  /* If all the bt available memory was already released,
   * cannot initialize bluetooth controller
   */

  if (g_btdm_dram_available_region[0].mode == ESP_BT_MODE_IDLE)
    {
      wlerr("Error, bt available memory was released\n");
      return -EIO;
    }

  /* Initialize list of interrupt flags to enable chained critical sections
   * to return sucessfully.
   */

  sq_init(&g_ble_int_flags_free);
  sq_init(&g_ble_int_flags_used);

  for (i = 0; i < NR_IRQSTATE_FLAGS; i++)
    {
      sq_addlast((sq_entry_t *)&g_ble_int_flags[i], &g_ble_int_flags_free);
    }

#ifdef CONFIG_ESP32_SPIFLASH

  /* Initialize interfaces that enable BLE ISRs to run during a
   * SPI flash operation.
   */

  if (esp_wireless_init() != OK)
    {
      return -EIO;
    }
#endif

  g_osi_funcs_p =
      (struct osi_funcs_s *)kmm_malloc(sizeof(struct osi_funcs_s));

  if (g_osi_funcs_p == NULL)
    {
      return -ENOMEM;
    }

  memcpy(g_osi_funcs_p, &g_osi_funcs_ro, sizeof(struct osi_funcs_s));
  if (btdm_osi_funcs_register(g_osi_funcs_p) != 0)
    {
      wlerr("Invalid OSI Functions\n");
      return -EINVAL;
    }

  if (g_btdm_controller_status != ESP_BT_CONTROLLER_STATUS_IDLE)
    {
      return ESP_ERR_INVALID_STATE;
    }

  /* overwrite some parameters */

  cfg.controller_task_stack_size = CONFIG_ESP32_BT_TASK_STACK_SIZE;
  cfg.controller_task_prio       = CONFIG_ESP32_BT_TASK_PRIORITY;
  cfg.bt_max_sync_conn           = CONFIG_BTDM_CTRL_BR_EDR_MAX_SYNC_CONN_EFF;
  cfg.magic                      = ESP_BT_CONTROLLER_CONFIG_MAGIC_VAL;

  wlerr("%s  %d: mode:%x\n", __func__, __LINE__, cfg.mode);
  if (((cfg.mode & ESP_BT_MODE_BLE) && (cfg.ble_max_conn <= 0 ||
        cfg.ble_max_conn > BTDM_CONTROLLER_BLE_MAX_CONN_LIMIT)) ||
      ((cfg.mode & ESP_BT_MODE_CLASSIC_BT) && (cfg.bt_max_acl_conn <= 0 ||
        cfg.bt_max_acl_conn > BTDM_CONTROLLER_BR_EDR_MAX_ACL_CONN_LIMIT)) ||
      ((cfg.mode & ESP_BT_MODE_CLASSIC_BT) &&
       (cfg.bt_max_sync_conn > BTDM_CONTROLLER_BR_EDR_MAX_SYNC_CONN_LIMIT)))
    {
      wlerr("%s  %d\n", __func__, __LINE__);
      return -EINVAL;
    }

  wlinfo("BT controller compile version [%s]",
          btdm_controller_get_compile_version());

  g_wakeup_req_sem = semphr_create_wrapper(1, 0);
  if (g_wakeup_req_sem == NULL)
    {
      err = -ENOMEM;
      goto error;
    }

  esp_phy_modem_init();

  esp_bt_power_domain_on();

