461911662/nuttx/arch/xtensa/src/boss1-esp32/esp32_bt_adapter.c
  btdm_controller_mem_init();

  periph_module_enable(PERIPH_BT_MODULE);

#ifdef CONFIG_PM
  g_btdm_allow_light_sleep = false;
#endif

  /* set default sleep clock cycle and its fractional bits */

  g_btdm_lpcycle_us_frac = RTC_CLK_CAL_FRACT;
  g_btdm_lpcycle_us = 2 << (g_btdm_lpcycle_us_frac);

#ifdef CONFIG_BTDM_CTRL_MODEM_SLEEP_MODE_ORIG
  g_btdm_lpclk_sel = BTDM_LPCLK_SEL_XTAL; /* set default value */
#ifdef CONFIG_BTDM_CTRL_LPCLK_SEL_EXT_32K_XTAL

  /* check whether or not EXT_CRYS is working */

  if (rtc_clk_slow_src_get() == SOC_RTC_SLOW_CLK_SRC_XTAL32K)
    {
      g_btdm_lpclk_sel = BTDM_LPCLK_SEL_XTAL32K; /* External 32kHz XTAL */
#ifdef CONFIG_PM
      g_btdm_allow_light_sleep = true;
#endif
    }
  else
    {
      wlwarn("32.768kHz XTAL not detected, fall back to main XTAL as "
             "Bluetooth sleep clock\n"
             "light sleep mode will not be able to apply when bluetooth "
             "is enabled");
      g_btdm_lpclk_sel = BTDM_LPCLK_SEL_XTAL; /* set default value */
    }
#else
  g_btdm_lpclk_sel = BTDM_LPCLK_SEL_XTAL; /* set default value */
#endif

  if (g_btdm_lpclk_sel == BTDM_LPCLK_SEL_XTAL)
    {
      select_src_ret = btdm_lpclk_select_src(BTDM_LPCLK_SEL_XTAL);
      set_div_ret = btdm_lpclk_set_div(esp_clk_xtal_freq() * 2 / MHZ - 1);
      assert(select_src_ret && set_div_ret);
      g_btdm_lpcycle_us_frac = RTC_CLK_CAL_FRACT;
      g_btdm_lpcycle_us = 2 << (g_btdm_lpcycle_us_frac);
    }
  else
    {
      /* g_btdm_lpclk_sel == BTDM_LPCLK_SEL_XTAL32K */

      select_src_ret = btdm_lpclk_select_src(BTDM_LPCLK_SEL_XTAL32K);
      set_div_ret = btdm_lpclk_set_div(0);
      assert(select_src_ret && set_div_ret);
      g_btdm_lpcycle_us_frac = RTC_CLK_CAL_FRACT;
      g_btdm_lpcycle_us = (RTC_CLK_CAL_FRACT > 15) ?
                          (1000000 << (RTC_CLK_CAL_FRACT - 15)) :
                          (1000000 >> (15 - RTC_CLK_CAL_FRACT));
      assert(g_btdm_lpcycle_us != 0);
    }

  btdm_controller_set_sleep_mode(BTDM_MODEM_SLEEP_MODE_ORIG);

#elif CONFIG_BTDM_CTRL_MODEM_SLEEP_MODE_EVED
  btdm_controller_set_sleep_mode(BTDM_MODEM_SLEEP_MODE_EVED);
  UNUSED(select_src_ret);
  UNUSED(set_div_ret);
#else
  btdm_controller_set_sleep_mode(BTDM_MODEM_SLEEP_MODE_NONE);
  UNUSED(select_src_ret);
  UNUSED(set_div_ret);
#endif

#if CONFIG_BTDM_CTRL_HCI_UART_FLOW_CTRL_EN
  sdk_config_set_uart_flow_ctrl_enable(true);
#else
  sdk_config_set_uart_flow_ctrl_enable(false);
#endif

#ifdef CONFIG_PM
  if ((err = esp_timer_create(&create_args, &g_btdm_slp_tmr) != OK))
    {
      wlerr("Failed to create timer");
      goto error;
    }

  g_pm_lock_acquired = true;
#endif

#if CONFIG_ESP32_WIFI_BT_COEXIST
  coex_init();
#endif

  btdm_cfg_mask = btdm_config_mask_load();

  wlinfo("Going to call btdm_controller_init\n");

  if (btdm_controller_init(btdm_cfg_mask, &cfg) != 0)
    {
      wlerr("Failed to initialize the BLE Controller\n");
      err = -ENOMEM;
      goto error;
    }

  wlinfo("The btdm_controller_init was initialized\n");

  g_btdm_controller_status = ESP_BT_CONTROLLER_STATUS_INITED;

  return OK;

error:

  bt_controller_deinit_internal();

  return err;
}

/****************************************************************************
 * Name: esp32_bt_controller_deinit
 *
 * Description:
 *   Deinit BT controller.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   Zero (OK) is returned on success. Otherwise, -1 (ERROR) is returned.
 *
 ****************************************************************************/

int esp32_bt_controller_deinit(void)
{
  if (g_btdm_controller_status != ESP_BT_CONTROLLER_STATUS_INITED)
    {
      return ERROR;
    }

  btdm_controller_deinit();

  bt_controller_deinit_internal();

  return OK;
}

/****************************************************************************
 * Name: esp32_bt_controller_enable
 *
 * Description:
 *   Enable BT controller.
 *
 * Input Parameters:
 *   mode - the mode(BLE/BT/BTDM) to enable. For compatible of API, retain
 *   this argument. This mode must be equal as the mode in "cfg" of
 *   esp_bt_controller_init().
 *
 * Returned Value:
 *   Zero (OK) is returned on success. A negated errno value is returned
 *   on failure.
 *
 ****************************************************************************/

int esp32_bt_controller_enable(esp_bt_mode_t mode)
{
  int ret = OK;

  if (g_btdm_controller_status != ESP_BT_CONTROLLER_STATUS_INITED)
    {
      return ERROR;
    }

  if (mode != btdm_controller_get_mode())
    {
      wlerr("invalid mode %d, controller support mode is %d",
            mode, btdm_controller_get_mode());
      return ERROR;
    }

#ifdef CONFIG_PM
  if (g_btdm_allow_light_sleep == false)
    {
      esp32_pm_lockacquire();
    }

  esp32_pm_lockacquire();
#endif

  esp_phy_enable(PHY_MODEM_BT);

#ifdef CONFIG_ESP32_WIFI_BT_COEXIST
  coex_enable();
#endif

  if (btdm_controller_get_sleep_mode() == BTDM_MODEM_SLEEP_MODE_ORIG)
    {
      btdm_controller_enable_sleep(true);
    }

  sdk_config_set_bt_pll_track_enable(true);

  /* inititalize bluetooth baseband */

  btdm_check_and_init_bb();

  ret = btdm_controller_enable(mode);
  if (ret != 0)
    {
#ifdef CONFIG_ESP32_WIFI_BT_COEXIST
      coex_disable();
#endif
      esp_phy_disable(PHY_MODEM_BT);
#ifdef CONFIG_PM
      if (g_btdm_allow_light_sleep == false)
        {
          esp32_pm_lockrelease();
        }

      esp32_pm_lockrelease();
#endif
      return ERROR;
    }

  g_btdm_controller_status = ESP_BT_CONTROLLER_STATUS_ENABLED;

  return esp_wifi_to_errno(ret);
}

/****************************************************************************
 * Name: esp32_bt_controller_disable
 *
 * Description:
 *   Disable BT controller.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   Zero (OK) is returned on success. A negated errno value is returned
 *   on failure.
 *
 ****************************************************************************/

int esp32_bt_controller_disable(void)
{
  if (g_btdm_controller_status != ESP_BT_CONTROLLER_STATUS_ENABLED)
    {
      return ERROR;
    }

